[{"color": "green", "id": "CSCI 111", "description": "A first-semester programming course, providing an overview of computer systems and an introduction to problem solving and software design using procedural object-oriented programming languages. Coverage includes the software life cycle, as well as algorithms and their role in software design. Students are expected to design, implement, and test a number of programs."}, {"color": "green", "id": "CHEM 111", "description": " GE"}, {"color": "green", "id": "MATH 120", "description": " GE"}, {"color": "green", "id": "MATH 121", "description": "The definite integral and applications to area, volume, work, differential equations, etc. Sequences and series, vectors and analytic geometry in 2 and 3-space, polar coordinates, and parametric equations."}, {"color": "green", "id": "EECE 144", "description": "Definition and properties of switching algebra. Minimization of algebraic function. Use of Karnaugh maps for simplification. Design of combinational logic networks. Design of sequential logic devices including flip-flops, registers, and counters. Analysis and applications of digital devices. Analysis and design of synchronous and asynchronous sequential state machines, state table derivation and reduction. Use of such CAD tools for schematic capture and logic device simulations."}, {"color": "green", "id": "PHYS 204B", "description": "Charge and matter, electric field, Gauss' law, electric potential, capacitors and dielectrics, current and resistance, magnetic field, Ampere's law, Faraday's law of induction, magnetic properties of matter, electromagnetic oscillations and waves. Calculus used."}, {"color": "green", "id": "PHYS 204A", "description": " GE"}, {"color": "green", "id": "EECE 211", "description": "DC and sinusoidal circuit analysis, including resistive, capacitive, and inductive circuit elements and independent sources. Ideal transformer. Thevenin and Norton circuit theorems and superposition. Phasors, impedance, resonance, and AC power. Three-phase AC Circuit analysis."}, {"color": "green", "id": "CSCI 211", "description": "A second semester object-oriented programming course in computer science that emphasizes problem solving. This course continues the study of software specification, design, implementation, and debugging techniques while introducing abstract data types, fundamental data structures and associated algorithms. Coverage includes dynamic memory, file I/O, linked lists, stacks, queues, trees, recursion, and an introduction to the complexity of algorithms. Students are expected to design, implement, test, and analyze a number of programs."}, {"color": "green", "id": "EECE 211L", "description": "Corequisites: EECE 211."}, {"color": "green", "id": "CSCI 217", "description": "Offers an intensive introduction to discrete mathematics as it is used in computer science. Topics include functions, relations, sets, propositional and predicate logic, simple circuit logic, proof techniques, elementary combinatorics, and discrete probability."}, {"color": "green", "id": "MATH 217", "description": "A rigorous introduction to discrete mathematical structures for computer science majors (fulfills a requirement for the minor in math). Topics include propositional and predicate calculus; basic proof methods; sets, functions, and operations with them; algorithms and their complexity; applications of number theory to computer science and computer security; matrices and matrix arithmetic; mathematical induction, recursive definitions and algorithms; combinatorics and counting techniques; relations and their representation by matrices and digraphs, applications to databases; equivalence relations and partitions of sets; partially ordered sets, lattices, and Boolean algebras; Boolean functions and circuits; graphs, trees, and their applications; formal languages and grammars; finite-state automata and language recognition, regular languages."}, {"color": "green", "id": "MATH 260", "description": "First order separable, linear, and exact equations; second order linear equations, Laplace transforms, series solutions at an ordinary point, systems of first order linear equations, and applications."}, {"color": "green", "id": "CIVL 302", "description": "Analysis of alternatives by basic engineering economic methods and applications of statistics including probability, sampling theory and data analysis, and tests of hypotheses."}, {"color": "green", "id": "EECE 311", "description": "Circuit analysis techniques for networks with both independent and dependent sources. Network topology. Natural and forced responses for RLC circuits. Complex frequency, poles, and zeros. Magnetically coupled circuits and two-port networks. Introduction to linear algebra, circuit simulation using PSPICE, and mathematical analysis using MATLAB."}, {"color": "green", "id": "EECE 315", "description": "Corequisites: EECE 311, MATH 260."}, {"color": "green", "id": "EECE 320", "description": "Study of computing architecture and how the structure of various hardware and software modules affects the ultimate performance of the total system. Topics include qualitative and quantitative analysis of bandwidths, response times, error detection and recovery, interrupts, and system throughput; distributed systems and coprocessors; vector and parallel architectures."}, {"color": "green", "id": "EECE 337", "description": "This course presents the concepts and techniques associated with developing low level Embedded Systems Applications, using both Assembly Language and C. Topics include microprocessor architecture concepts, instruction set architectures, Assembly Language programming, data representations, interrupt handling and execution modes, low level C programming, and the use of on-chip and external peripherals."}, {"color": "green", "id": "EECE 343", "description": "Circuit design techniques for interfacing computers and digital systems to analog systems. Topics include interfacing to sensors, transduction, pulse generation and shaping, level detection, triggering, A/D and D/A conversions, timers, pulse width modulation, VGA signal generation and mouse design. Interface-development methodologies, implementation tools, testing, and quality assessment, including VHDL and PSPICE. State machine design and analysis."}, {"color": "green", "id": "EECE 344", "description": "Extends the study of digital circuits to LSI and VLSI devices. Use of computer simulation in system analysis and design verification. 8-bit and 16-bit microprocessors, architecture, bus organization and address decoding. Design concepts for microprocessor systems, including system integration with programmable logic devices. Interfacing to A/D and P/A Converters. Design of input and output ports and interface to programmable ports. Serial communications; interrupt processing. Use of codes for storage and transmission of information: parity, ASCII, Hamming and other error detecting and correcting codes."}, {"color": "green", "id": "EECE 365", "description": "Modeling and analysis of Signals and Systems both continuous and discrete, in the time and frequency domains. Topics include theorey and application of Fourier series, Fourier transforms, Parseval's Theorem and the Convolution, Laplace Transform Sampling Theorem, Z transform, discrete Fourier Transform and FFT."}, {"color": "green", "id": "CSCI 430", "description": " GW"}, {"color": "green", "id": "EECE 437", "description": "This course presents the concepts and techniques associated with designing, developing, and testing real-time and embedded systems. Topics include the nature and uses of real-time systems, architecture and design of real-time systems, embedded development and debugging environments, embedded programming techniques, real-time operating systems and real-time scheduling and algorithms. Special attention is given to the study of real-time process scheduling and performance, including mathematical analysis of scheduling algorithms."}, {"color": "green", "id": "EECE 444", "description": "Advanced microprocessor design concepts and techniques. Timing considerations and calculations for reliable high-speed processor operating frequencies. Interrupts for real-time processing; interfacing microprocessors to Dynamic Random Access Memories. Designing DRAM controllers using state machine design procedures. Direct Memory Access Controllers (DMAs) and multi-master systems. Programmable Parallel Ports and Timers. Special purpose processors for digital signal processing, communications and multimedia applications."}, {"color": "green", "id": "EECE 482", "description": "Modeling and simulation of dynamic system performance. Control system design for continuous systems using both analog and digital control techniques."}, {"color": "green", "id": "EECE 490B", "description": "In a continuation of EECE 490A, students complete detailed designs, construct, test, and demonstrate their senior design project. Design documentation must address sustainability, manufacturability and, if appropriate, health and safety issues. Formal oral and written reports documenting the project are required."}, {"color": "green", "id": "EECE 490A", "description": " GW"}, {"color": "green", "id": "CIVL 495", "description": "History of engineering, professional registration, codes of ethics, management issues, diversity, outsourcing, intellectual property, international development and technology transfer, sustainable design. A substantial written project with oral presentation is required."}, {"color": "green", "id": "EECE 555", "description": "An introduction to networking technologies and architecture focusing on ISO and Internet models with discussion of current standards and protocols.  Significant lab work using current networking equipment reinforces lectures and provides fundamental experience with device management."}]